Ran Plan for 2 projects:

1. dir: `infra/us-east-1/mgmt/vpc` workspace: `default`
1. dir: `infra/global/iam/roles/atlantis` workspace: `default`

### 1. dir: `infra/us-east-1/mgmt/vpc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "management-vpc-private-us-east-1a"
        }
      + tags_all         = {
          + "Environment"  = "mgmt"
          + "Name"         = "management-vpc-private-us-east-1a"
          + "Organization" = "iog"
          + "Project"      = "scde"
          + "Terraform"    = "true"
          + "Tribe"        = "smartcontracts"
        }
      + vpc_id           = "vpc-05d9f25d63d8ffb04"
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.100.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "management-vpc-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Environment"  = "mgmt"
          + "Name"         = "management-vpc-private-us-east-1a"
          + "Organization" = "iog"
          + "Project"      = "scde"
          + "Terraform"    = "true"
          + "Tribe"        = "smartcontracts"
        }
      + vpc_id                                         = "vpc-05d9f25d63d8ffb04"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ database_route_table_ids                    = [
        # (1 unchanged element hidden)
        "rtb-0e05291c6e89bd13d",
      + (known after apply),
    ]
  ~ elasticache_route_table_ids                 = [
      - "rtb-0f8770a1cde5a93e4",
      - "rtb-0e05291c6e89bd13d",
    ] -> (known after apply)
  ~ private_route_table_association_ids         = [
        # (1 unchanged element hidden)
        "rtbassoc-01174579f66ad3981",
      + (known after apply),
    ]
  ~ private_route_table_ids                     = [
        # (1 unchanged element hidden)
        "rtb-0e05291c6e89bd13d",
      + (known after apply),
    ]
  ~ private_subnet_arns                         = [
        # (1 unchanged element hidden)
        "arn:aws:ec2:us-east-1:677160962006:subnet/subnet-00d85bd5f45d9bca7",
      + (known after apply),
    ]
  ~ private_subnets                             = [
        # (1 unchanged element hidden)
        "subnet-00d85bd5f45d9bca7",
      + (known after apply),
    ]
  ~ private_subnets_cidr_blocks                 = [
        # (1 unchanged element hidden)
        "10.100.48.0/20",
      + "10.100.64.0/20",
    ]
  ~ redshift_route_table_ids                    = [
        # (1 unchanged element hidden)
        "rtb-0e05291c6e89bd13d",
      + (known after apply),
    ]
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/vpc`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. dir: `infra/global/iam/roles/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.0.0"...
- Installing hashicorp/aws v5.31.0...
- Installed hashicorp/aws v5.31.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_eks_cluster.main["scde-dev-us-east-1"]: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_eks_cluster.main["scde-dev-us-east-1"]: Read complete after 0s [id=scde-dev-us-east-1]
data.aws_iam_policy_document.assume_role_with_oidc: Reading...
data.aws_iam_policy_document.assume_role_with_oidc: Read complete after 0s [id=1855650393]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/CF3527C40042EA2A9E0A19B5C92CB4C9:sub" = "system:serviceaccount:default:provider-aws-*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::677160962006:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/CF3527C40042EA2A9E0A19B5C92CB4C9"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "AtlantisDevRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment"  = "prod"
          + "Organization" = "iog"
          + "Project"      = "scde"
          + "Terraform"    = "true"
          + "Tribe"        = "smartcontracts"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.this["AmazonAdminAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "AtlantisDevRole"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + iam_role_arn       = (known after apply)
  ~ iam_role_name      = "AtlantisRole" -> "AtlantisDevRole"
  + iam_role_unique_id = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/global/iam/roles/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fglobal%252Fiam%252Froles%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/global/iam/roles/atlantis`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`